### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.send_api_v1 will be created
  + resource "azurerm_api_management_api" "send_api_v1" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Send AAR - API"
      + display_name          = "IO Send AAR - API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-itn-send-aar-api-01"
      + path                  = "api/v1/send"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/d80ef63a1ddf88eec5753ad67007cd365496b2b5/apps/send-func/openapi/aar-notification.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.send_aar_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "send_aar_api_v1_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-itn-send-aar-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/6c5e49df1dae30811c374e41cbcdf06c7d4b85a2/infra/resources/_modules/apim/api/send/policy.xml"
    }

  # module.apim.azurerm_api_management_policy_fragment.auth will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "auth" {
      ~ format            = "xml" -> "rawxml"
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment"
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue(&quot;Authorization&quot;, out values) ? values.FirstOrDefault() : &quot;&quot;;   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          - 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables[&quot;token&quot;]) ||       !(((string)context.Variables[&quot;token&quot;]).StartsWith(&quot;Bearer &quot;, StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables[&quot;token&quot;]).Substring(7))     )">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          - 	</send-request>
          - 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          - 				<value>@(
          -           Convert.ToBase64String(
          -               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          -           )
          -         )</value>
          - 			</set-header>
          - 		</when>
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</otherwise>
          - 	</choose>
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value='@{
          +     string[] values;
          +     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          +   }' />
          + 
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition='@(
          +       string.IsNullOrEmpty((string)context.Variables["token"]) ||
          +       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
          +       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          +     )'>
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          + 
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)'>
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value='@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())' />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
          + 				<value>@(
          +           Convert.ToBase64String(
          +               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          +           )
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)'>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (2 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_send_aar will be created
  + resource "azurerm_api_management_product" "apim_itn_product_send_aar" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for IO SEND AAR API"
      + display_name          = "IO SEND AAR API"
      + id                    = (known after apply)
      + product_id            = "io-send-aar-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim.azurerm_api_management_product_api.send_aar_api_v1_product_api will be created
  + resource "azurerm_api_management_product_api" "send_aar_api_v1_product_api" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-itn-send-aar-api-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_send_policy will be created
  + resource "azurerm_api_management_product_policy" "apim_itn_product_send_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/d80ef63a1ddf88eec5753ad67007cd365496b2b5/infra/resources/_modules/apim/product/policy.xml"
    }

  # module.web_apps.module.send_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-send-func-01"
        name                                           = "io-p-itn-com-send-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

</details>
